#include <iostream>
#include <string>
using namespace std;

void printStudents(string surnames[], string names[], int n) {
    for (int i = 0; i < n; i++) {
        cout << surnames[i] << " " << names[i] << endl;
    }
}

int main() {
    setlocale(LC_ALL, "RU");

    string surnames[25] = { "Иванов", "Петров", "Сидоров", "Кузнецов", "Смирнов", "Васильев", "Попов", "Новиков", "Федоров", "Морозов",
                           "Волков", "Алексеев", "Лебедев", "Семенов", "Егоров", "Павлов", "Козлов", "Степанов", "Николаев", "Орлов",
                           "Андреев", "Макаров", "Никитин", "Захаров", "Зайцев" };
    string names[25] = { "Алексей", "Иван", "Сергей", "Дмитрий", "Андрей", "Максим", "Евгений", "Михаил", "Владимир", "Александр",
                        "Олег", "Павел", "Константин", "Игорь", "Роман", "Виктор", "Николай", "Юрий", "Георгий", "Станислав",
                        "Артем", "Даниил", "Кирилл", "Леонид", "Федор" };

    printStudents(surnames, names, 25);

    return 0;
}