#include <iostream>
#include <string>
using namespace std;

void printItalianCities(string cities[], string countries[], int n) {
    for (int i = 0; i < n; i++) {
        if (countries[i] == "Италия") {
            cout << cities[i] << endl;
        }
    }
}

int main() {
    setlocale(LC_ALL, "RU");

    string cities[26] = { "Рим", "Париж", "Мадрид", "Милан", "Неаполь", "Берлин", "Лондон", "Венеция", "Флоренция", "Амстердам",
                         "Барселона", "Прага", "Вена", "Будапешт", "Варшава", "Лиссабон", "Стамбул", "Афины", "Дублин", "Осло",
                         "Стокгольм", "Копенгаген", "Хельсинки", "Рига", "Вильнюс", "Таллин" };
    string countries[26] = { "Италия", "Франция", "Испания", "Италия", "Италия", "Германия", "Великобритания", "Италия", "Италия", "Нидерланды",
                            "Испания", "Чехия", "Австрия", "Венгрия", "Польша", "Португалия", "Турция", "Греция", "Ирландия", "Норвегия",
                            "Швеция", "Дания", "Финляндия", "Латвия", "Литва", "Эстония" };

    printItalianCities(cities, countries, 26);

    return 0;
}