#include <iostream>
#include <string>
using namespace std;

void printClubs(string clubs[], string cities[], int n) {
    for (int i = 0; i < n; i++) {
        cout << clubs[i] << " - " << cities[i] << endl;
    }
}

int main() {
    setlocale(LC_ALL, "RU");

    string clubs[20] = { "Спартак", "ЦСКА", "Зенит", "Динамо", "Локомотив", "Краснодар", "Ростов", "Уфа", "Крылья Советов", "Рубин",
                        "Ахмат", "Урал", "Арсенал", "Сочи", "Нижний Новгород", "Химки", "Факел", "Балтика", "Енисей", "Томь" };
    string cities[20] = { "Москва", "Москва", "Санкт-Петербург", "Москва", "Москва", "Краснодар", "Ростов-на-Дону", "Уфа", "Самара", "Казань",
                         "Грозный", "Екатеринбург", "Тула", "Сочи", "Нижний Новгород", "Химки", "Воронеж", "Калининград", "Красноярск", "Томск" };

    printClubs(clubs, cities, 20);

    return 0;
}