#include <iostream>
#include <cmath>
using namespace std;

int main() {
    setlocale(LC_ALL, "RU");
    double a, b;

    // Ввод сторон прямоугольника
    cout << "\t\t\tВычисление периметра и диагонали прямоугольника" << "\n";
    cout << "Введите длину стороны a: ";
    cin >> a;
    cout << "Введите длину стороны b: ";
    cin >> b;

    // Проверка корректности данных
    if (a <= 0 || b <= 0) {
        cout << "Ошибка: Стороны должны быть положительными!" << "\n";
        return 1;
    }

    // Вычисление периметра
    double P = 2 * (a + b);

    // Вычисление диагонали
    double d = sqrt(a * a + b * b);

    // Вывод результата
    cout << "\nРезультат:" << "\n";
    cout << "Периметр P = 2 * (a + b) = 2 * (" << a << " + " << b << ") = " << P << "\n";
    cout << "Диагональ d = sqrt(a^2 + b^2) = sqrt(" << pow(a, 2) << " + " << pow(b, 2) << ") = " << d << "\n";

    return 0;
}