#include <iostream>
using namespace std;

int main() {
    setlocale(LC_ALL, "RU");
    int a, b, c;
    cout << "Введите три различных целых числа: ";
    cin >> a >> b >> c;

    // а) самое большое
    if (a > b && a > c) {
        cout << "а) Самое большое: первое (" << a << ")\n";
    }
    else if (b > a && b > c) {
        cout << "а) Самое большое: второе (" << b << ")\n";
    }
    else {
        cout << "а) Самое большое: третье (" << c << ")\n";
    }

    // б) самое маленькое
    if (a < b && a < c) {
        cout << "б) Самое маленькое: первое (" << a << ")\n";
    }
    else if (b < a && b < c) {
        cout << "б) Самое маленькое: второе (" << b << ")\n";
    }
    else {
        cout << "б) Самое маленькое: третье (" << c << ")\n";
    }

    // в) среднее
    if ((a > b && a < c) || (a < b && a > c)) {
        cout << "в) Среднее: первое (" << a << ")\n";
    }
    else if ((b > a && b < c) || (b < a && b > c)) {
        cout << "в) Среднее: второе (" << b << ")\n";
    }
    else {
        cout << "в) Среднее: третье (" << c << ")\n";
    }

    return 0;
}