#include <iostream>
using namespace std;

int main() {
    setlocale(LC_ALL, "RU");
    int a, b, c, d;
    cout << "Введите координаты (a b c d): ";
    cin >> a >> b >> c >> d;

    // а) ладья
    if (a == c || b == d) {
        cout << "а) Ладья угрожает полю\n";
    }
    else {
        cout << "а) Ладья не угрожает полю\n";
    }

    // б) слон
    if (abs(a - c) == abs(b - d)) {
        cout << "б) Слон угрожает полю\n";
    }
    else {
        cout << "б) Слон не угрожает полю\n";
    }

    // в) король
    if (abs(a - c) <= 1 && abs(b - d) <= 1) {
        cout << "в) Король может попасть на поле\n";
    }
    else {
        cout << "в) Король не может попасть на поле\n";
    }

    // г) ферзь
    if (a == c || b == d || abs(a - c) == abs(b - d)) {
        cout << "г) Ферзь угрожает полю\n";
    }
    else {
        cout << "г) Ферзь не угрожает полю\n";
    }

    // д) белая пешка
    if ((b + 1 == d && a == c) || (b + 1 == d && abs(a - c) == 1)) {
        cout << "д) Белая пешка может попасть на поле\n";
    }
    else {
        cout << "д) Белая пешка не может попасть на поле\n";
    }

    // е) черная пешка
    if ((b - 1 == d && a == c) || (b - 1 == d && abs(a - c) == 1)) {
        cout << "е) Черная пешка может попасть на поле\n";
    }
    else {
        cout << "е) Черная пешка не может попасть на поле\n";
    }

    // ж) конь
    if ((abs(a - c) == 2 && abs(b - d) == 1) || (abs(a - c) == 1 && abs(b - d) == 2)) {
        cout << "ж) Конь угрожает полю\n";
    }
    else {
        cout << "ж) Конь не угрожает полю\n";
    }

    return 0;
}