#include <iostream>
using namespace std;

int main() {
    setlocale(LC_ALL, "RU");
    double a1, a2, a3, b1, b2, b3;
    cout << "Введите размеры чемодана (a1 a2 a3) в см: ";
    cin >> a1 >> a2 >> a3;
    cout << "Введите размеры коробки (b1 b2 b3) в см: ";
    cin >> b1 >> b2 >> b3;

    // Проверяем, помещается ли коробка в чемодан
    if ((b1 <= a1 && b2 <= a2 && b3 <= a3) ||
        (b1 <= a1 && b2 <= a3 && b3 <= a2) ||
        (b1 <= a2 && b2 <= a1 && b3 <= a3) ||
        (b1 <= a2 && b2 <= a3 && b3 <= a1) ||
        (b1 <= a3 && b2 <= a1 && b3 <= a2) ||
        (b1 <= a3 && b2 <= a2 && b3 <= a1)) {
        cout << "Коробка помещается в чемодан, можно сэкономить\n";
    }
    else {
        cout << "Коробка не помещается в чемодан\n";
    }

    return 0;
}